create database firm
On (Name = firm_dat,
Filename = 'C:\firm.mdf')
Log on (Name = firm_log,
Filename = 'C:\firm.ldf')

use firm
create table rieltors
(id_rieltor int primary key not null,
second_name nvarchar(20) not null,
first_name nvarchar(20) not null,
middle_name nvarchar(20) not null,
phone_number nvarchar(10) not null
check (phone_number Like('[0][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]')),
email nvarchar(30) not null
check (email Like('%_@____%')),
premium nvarchar(5) not null
check (premium between 0 and 100))

Insert into rieltors
values
(2001,'Арама','Ольга','Федорівна','0737389562','arama@ukr.net','5'),
(2002,'Бак','Роман','Юрійович','0938472947','bak@gmail.com','10'),
(2003,'Балабан','Анастасія','Олександрівна','0736098267','balaban@gmail.com','12'),
(2004,'Бойко','Роман','Володимирович','0668363785','boyko@gmail.com','25'),
(2005,'Вовк','Володимир','Володимирович','0957301264','vovk@ukr.net','5'),
(2006,'Грицик','Юлія','Андріївна','0996409271','grizik@gmail.com','8'),
(2007,'Гутів','Андрій','Олегович','0507893610','gutiv@mail.ru','10'),
(2008,'Гремента','Олена','Євгеніївна','0974679027','grementa@ukr.net','18'),
(2009,'Дворянська','Анна-Анастасія','Тарасівна','0995378904','dvorianska@gmail.com','12'),
(2010,'Демян','Василь','Миколайович','0937890674','demon@mail.ru','15'),
(2011,'Дзьоба','Вікторія','Андріївна','0736789306','dzioba@gmail.com','15'),
(2012,'Діжак','Оксана','Ярославівна','0996478936','dighak@ukr.net','15'),
(2013,'Маслій','Олександра','Романівна','0669349947','masliy@mail.ru','20'),
(2014,'Маліков','Валентин','Михайлович','0508390267','malikoff@gmail.com','20'),
(2015,'Пригара','Василь','Володимирович','0937490123','prihara@mail.ru','20'),
(2016,'Поліщак','Ірина','Ігорівна','0678930294','polishchak@ukr.net','5'),
(2017,'Ракова','Анастасія','Андріївна','0996478902','rakova@gmail.com','25'),
(2018,'Романенко','Ольга','Олександрівна','0736789043','romanenko@mail.ru','10'),
(2019,'Секета','Данило','Львович','0996784321','seketa@ukr.net','5'),
(2020,'Смольський','Дмитро','Миколайович','0937894673','smolskiy@gmail.com','8')

delete from rieltors
where id_rieltor=2014

delete from rieltors
where phone_number like '050%'

delete from rieltors
where premium>=20

 Insert into rieltors
values
(2014,'Фик','Володимир','Юрійович','0737389362','fik@ukr.net','8'),
(2007,'Гутів','Андрій','Олегович','0937893610','gutiv@mail.ru','10'),
(2004,'Бойко','Роман','Володимирович','0668363785','boyko@gmail.com','18'),
(2013,'Маслій','Олександра','Романівна','0669349947','masliy@mail.ru','17'),
(2015,'Пригара','Василь','Володимирович','0937490123','prihara@mail.ru','19'),
(2017,'Ракова','Анастасія','Андріївна','0996478902','rakova@gmail.com','15')

update rieltors
set second_name='Дем*ян'
where id_rieltor=2010

update rieltors
set second_name='Когут'
where second_name='Поліщак'

update rieltors
set premium=10
where premium<10

update rieltors
set phone_number='0997397481'
where second_name='Бак'

update rieltors
set premium=premium+1
where email like '%@ukr.net'

update rieltors
set premium=premium-2
where email like '%@mail.ru'

create table clients
(client_passport nvarchar(8) primary key not null,
second_name nvarchar(20) not null,
first_name nvarchar(20) not null,
middle_name nvarchar(20) not null,
sex nvarchar(3) not null,
phone_number nvarchar(10) not null
check (phone_number Like('[0][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]')),
email nvarchar(30) null
check (email Like('%_@____%')),
certificate_of_income nvarchar(1) null)

insert into clients
values 
('ТМ423423', 'Меркулова', 'Лариса','Андріївна', 'жін', '0675564521', 'kulioleg@yandex.ru','+'),
('КС561440', 'Жуков', 'Максим','Олексійович', 'чол', '0975434237','kuz.wot@rambler.ru','+'),
('ММ325846', 'Шаповалова', 'Катерина','Юріївна', 'жін', '0974562420','Lagutina75@list.ru','-'),
('КМ403775', 'Федченко', 'Юлія','Дмитрівна', 'жін', '0501230894','Leonid3798@bk.ru','+'),
('НА600677', 'Бурова', 'Світлана','Андріївна', 'жін', '0952303003','live@intersat.ru','-'),
('ПР229521', 'Коротких', 'Кристина','Володимирівна', 'жін', '0956002508','Kukuruzaaaaaa24@mail.ru','-'),
('КК583229', 'Білокінь', 'Наталя','Віталіївна', 'жін', '0676799981','L.Messi2000@mail.ru','-'),
('МТ226000', 'Костюк', 'Олена','Борисівна', 'жін', '0503711254','zoggar@gmail.com','-'),
('ЛО891708', 'Орел', 'Карина','Валеріївна', 'жін', '0677620560','sas.lev28@mail.ru','-'),
('ГН376244', 'Морозова', 'Олександра','Григорівна', 'жін', '0973807630',null,'+'),
('РО129096', 'Коваленко', 'Поліна','Валеріївна', 'жін', '0675215689','naki812@i.ua','+'),
('ЕЕ561788', 'Ерешова', 'Яна','Миколаївна', 'жін', '0639424943',null,'+'),
('ТТ820148', 'Демянчук', 'Катерина','Фодорівна', 'жін', '0983295641','nikitka.kenya@ukr.net','+'),
('СТ174454', 'Піщуліна', 'Дар*я','Павлівна', 'жін', '0667956522','mno64@yandex.ru','-'),
('ЛО892635', 'Сівко', 'Богдан','Ігорович', 'чол', '0735298551','belka07101993@gmail.com','+'),
('ЦУ751315', 'Мішкевич', 'Артем','Сергійович', 'чол', '0502327742','best-player@inbox.ua','-'),
('НФ834452', 'Скляр', 'Дмитро','Вікторович', 'чол', '0737545641','barxat_098@i.ua','+'),
('ВА955103', 'Гапєєва', 'Віра','Олександрівна', 'жін', '0675442311',null,'+'),
('ДЕ736880', 'Ізмайлова', 'Аліна','Ренатівна', 'жін', '0987865642',null,'+'),
('НО180875', 'Мініна', 'Маргарита','Андріївна', 'жін', '0671298440','bonantonio@mail.ua','+'),
('ТМ873856', 'Барабаш', 'Ірина','Сергіївна', 'жін', '0507645413','burnevich_34@mail.ru','-'),
('ЗО998832', 'Мустяца', 'Ігор','Іларіонович', 'чол', '0505654736','zatola89@rambler.ru','+'),
('УП908535', 'Падеріна', 'Крістіна','Андріївна', 'жін', '0506800641', null,'-'),
('РВ634023', 'Шатурська', 'Тетяна','Сергіївна', 'жін', '0976532324', null,'-'),
('ЕП420618', 'Михайлова', 'Юлія','Геннадіївна', 'жін', '0987056546','zmei-ruslan@rambler.ua','-'),
('НО981422', 'Кот', 'Олександра','Русланівна', 'жін', '0992232848',null,'-'),
('СВ384536', 'Чубата', 'Юлія','Валеріївна', 'жін', '0501198435','wot-top2200@i.ua','-'),
('ФВ376228', 'Турищева', 'Марія','Сергіївна', 'жін', '0937124975','xano@divermail.com','-'),
('ИС235959', 'Сторожук', 'Кирило','Валерійович', 'чол', '0686852136','yps666@yandex.ru','+'),
('РМ860900', 'Володіна', 'Поліна','Вікторівна', 'жін', '0509785201','wmh@bk.ru','-'),
('ТЛ550020', 'Косенкова', 'Ольга','Андріївна', 'жін', '0971265485','Wadimka222@nail.com','+'),
('ЕК812201', 'Авраменко', 'Маргарита','Сергіївна', 'жін', '0505032368','w1rus.mail@gmail.com','+'),
('ОП127182', 'Граматік', 'Катерина','Анатоліївна', 'жін', '0989432169','vovan18032001@gmail.com','+'),
('КЦ119647', 'Шаповалов', 'Денис',' Олегович', 'чол', '0673521949',null,'+'),
('ЛК644320', 'Євич', 'Діана','Сергіївна', 'жін', '0735698744','volkmen1775@meta.ua','+'),
('ОП425691', 'Копєйка', 'Марія','Валеріївна', 'жін', '0501123569','westbod46217@ukr.net','+'),
('ВЛ501619', 'Лонь', 'Дар*я','Сергіївна', 'жін', '0662212687','vladislav.pilgun@ukr.net','-'),
('ГХ466415', 'Гонтарєва', 'Тетяна','Євгеніївна', 'жін', '0979765200','veremchuk.igor23@gmail.com','-'),
('РР151497', 'Декалюк', 'Ілона','Георгіївна', 'жін', '0687504144','viktor.kuzmin.2012@list.ru','+'),
('МД994643', 'Шихірєва', 'Ольга', 'Іванівна', 'жін', '0975033107',null,'-'),
('ММ753493', 'Данькова', 'Вікторія','Дмитрівна', 'жін', '0957059957','vantoniuk@mail.ua','+'),
('ВЛ615359', 'Павловский', 'Олег','Юрійович', 'чол', '0971117853',null,'-'),
('ІР599733', 'Олейник', 'Марина','Сергіївна', 'жін', '0983247357','vadim.sokolov.1993@gmail.com','-'),
('ЄП943691', 'Попазогло', 'Вадим','Олегович', 'чол', '0507889978',null,'-'),
('ЮД909139', 'Легась', 'Катерина','Дмитрівна', 'жін', '0975652119','trekal223221@gmail.com','+'),
('ХГ128607', 'Белоус', 'Костянтин','Ігорович', 'чол', '0635232117','vasik2390@mail.ru','-'),
('ВС264110', 'Курочка', 'Владислав','Павлович', 'чол', '0935353055','temagoryachev@bk.ru','+'),
('НТ158488', 'Шестова', 'Ольга','Юріївна', 'жін', '0965002320',null,'-'),
('АК464296', 'Григоренко', 'Юлія','Віталіївна', 'жін', '0662032321','tip.kazan@list.ru','+'),
('АШ432549', 'Марковский', 'Артем','Валерійович', 'чол', '0956502218','sorokin.vlad.ter4@yandex.ua','+')